[
    {
      "shoeName": "Jordan 11 Retro Low Bred (2025)",
      "brand": "Jordan",
      "silhoutte": "Jordan 11 Retro Low",
      "styleID": "FV5104-006",
      "make": "Jordan 11 Retro Low",
      "colorway": "Black/White-Varsity Red",
      "retailPrice": 190,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-11-Retro-Low-Bred-2025-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1744933373",
      "releaseDate": "2025-04-26",
      "description": "The Air Jordan 11 Retro Low Bred (2025) brings back a legendary look with a fresh twist. This low-top version of the iconic 'Bred' colorway features a sleek black mesh upper, glossy patent leather mudguards, and bold varsity red accents. The white midsole and translucent red outsole complete the classic design, making it a standout addition to any sneaker rotation.<br><br>Inspired by the PE pair Michael Jordan wore during the 1996 season, this release pays homage to a significant moment in basketball history. The combination of materials and colors not only delivers a nostalgic feel but also offers the truest remake of this colorway  on the 11 low to ever release to the public. Whether you're hitting the court or the streets, these kicks are designed to turn heads.<br><br>Released on April 26, 2025, the Air Jordan 11 Retro Low Bred (2025) retailed at $190. Its black, white, and varsity red colorway continues to captivate sneaker enthusiasts worldwide.",
      "urlKey": "air-jordan-11-retro-low-bred-2025",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-11-retro-low-bred-2025"
      },
      "lowestResellPrice": {
        "stockX": 190
      }
    },
    {
      "shoeName": "Jordan 4 Retro SB Navy",
      "brand": "Jordan",
      "silhoutte": "Jordan 4 Retro SB",
      "styleID": "DR5415-100",
      "make": "Jordan 4 Retro SB",
      "colorway": "Summit White/White/Navy/Neutral Grey/Gum Yellow/Varsity Red",
      "retailPrice": 225,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-4-Retro-SB-Navy-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1740411181",
      "releaseDate": "2025-03-18",
      "description": "The Jordan 4 Retro SB Navy blends basketball heritage with skateboarding functionality, continuing the successful partnership between Nike SB and Jordan Brand. Following the hype of the \"Pine Green\" release, this edition swaps green for navy, adding a sleek and timeless twist to the SB-enhanced Air Jordan 4 silhouette. The upper features summit white leather with navy accents on the eyelets, heel tab, and midsole, delivering a clean yet bold aesthetic. A vibrant red Jumpman logo on the tongue and insoles provides a striking contrast, while the Nike SB branding on the heel cements this crossover’s skate-ready DNA.<br><br>Designed with performance in mind, the Jordan 4 Retro SB Navy incorporates subtle modifications tailored for skateboarding. The reworked sole offers enhanced grip and flexibility, while premium materials ensure durability whether you’re on the board or the streets. The signature mesh side panels and classic lace cage maintain the AJ4’s iconic look, seamlessly merging style and function. The gum yellow outsole adds a vintage-inspired touch while improving traction—essential for both skaters and sneakerheads alike.<br><br>Landing on March 18, 2025, for a retail price of $225, the Jordan 4 Retro SB Navy marks the next evolution of this crossover collaboration. With its blend of skate and basketball culture, this release is set to make waves among collectors and casual wearers alike.",
      "urlKey": "air-jordan-4-retro-sb-navy",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-4-retro-sb-navy"
      },
      "lowestResellPrice": {
        "stockX": 250
      }
    },
    {
      "shoeName": "Jordan Jumpman Jack TR Travis Scott Bright Cactus",
      "brand": "Jordan",
      "silhoutte": "Jordan Jumpman Jack TR",
      "styleID": "FZ8117-102",
      "make": "Jordan Jumpman Jack TR",
      "colorway": "Muslin/Black/Bright Cactus",
      "retailPrice": 200,
      "thumbnail": "https://images.stockx.com/images/air-jordan-jumpman-jack-tr-travis-scott-bright-cactus.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1745503228",
      "releaseDate": "2025-04-30",
      "description": "Please Note: Dust bag is not required",
      "urlKey": "air-jordan-jumpman-jack-tr-travis-scott-bright-cactus",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-jumpman-jack-tr-travis-scott-bright-cactus"
      },
      "lowestResellPrice": {
        "stockX": 305
      }
    },
    {
      "shoeName": "Nike Jordan Jalen Hurts Love Hurts Hoodie Black",
      "brand": "Nike",
      "silhoutte": "Nike Jordan Jalen Hurts Love Hurts",
      "styleID": "IQ3843-010",
      "make": "Nike Jordan Jalen Hurts Love Hurts",
      "colorway": "Black",
      "retailPrice": 75,
      "thumbnail": "https://images.stockx.com/images/Nike-Jordan-Jalen-Hurts-Love-Hurts-Hoodie-Black.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1741026352",
      "releaseDate": "2025-03-03",
      "description": "",
      "urlKey": "nike-jordan-jalen-hurts-love-hurts-hoodie-black",
      "resellLinks": {
        "stockX": "https://stockx.com/nike-jordan-jalen-hurts-love-hurts-hoodie-black"
      },
      "lowestResellPrice": {
        "stockX": 118
      }
    },
    {
      "shoeName": "Jordan 11 Retro Low Bred (GS) (2025)",
      "brand": "Jordan",
      "silhoutte": "Jordan 11 Retro Low",
      "styleID": "FV5121-006",
      "make": "Jordan 11 Retro Low",
      "colorway": "Black/White-Varsity Red",
      "retailPrice": 150,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-11-Retro-Low-Bred-2025-GS-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1743702361",
      "releaseDate": "2025-04-26",
      "description": "",
      "urlKey": "air-jordan-11-retro-low-bred-2025-gs",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-11-retro-low-bred-2025-gs"
      },
      "lowestResellPrice": {
        "stockX": 120
      }
    },
    {
      "shoeName": "Jordan 11 Retro Legend Blue (2024)",
      "brand": "Jordan",
      "silhoutte": "Jordan 11 Retro",
      "styleID": "CT8012-104",
      "make": "Jordan 11 Retro",
      "colorway": "White/Legend Blue/Black",
      "retailPrice": 230,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-11-Retro-Legend-Blue-2024-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-12-14",
      "description": "The Jordan 11 Retro Legend Blue (2024), also known as the Columbia 11s, is easily one of the most well known and beloved colorways of the Jordan 11 ever produced. Dating back to 1996, this sneaker has only retro'd twice since then, with the latest version being 10 years ago in 2014. <br><br> The Legend Blue 11s feature an all white upper with white laces and an icy blue sole. The Jumpman logo pops in a Legend Blue accent as the finishing touch on this clean colorway. Jordan was famously spotted wearing these for the first time in the 1996 All-Star game, donning the now-iconic teal blue jerseys as the East defeated the West in San Antonio by a score of 129 to 118, in which Jordan was the game's MVP. <br><br> The Jordan 11 Retro Legend Blue (2024) released on December 14th, 2024, for a retail price of $230. Our experts love this sneaker due to its storied history and infrequent retro releases, making this sneaker likely to be ever-more collectible as the years go on.",
      "urlKey": "air-jordan-11-retro-legend-blue-2024",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-11-retro-legend-blue-2024"
      },
      "lowestResellPrice": {
        "stockX": 168
      }
    },
    {
      "shoeName": "Jordan 3 Retro Black Cat (2025)",
      "brand": "Jordan",
      "silhoutte": "Jordan 3 Retro",
      "styleID": "CT8532-001",
      "make": "Jordan 3 Retro",
      "colorway": "Black/Dark Charcoal/Black",
      "retailPrice": 200,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-3-Retro-Black-Cat-2025-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2025-01-11",
      "description": "The Air Jordan 3 Retro Black Cat (2025) is a revival of an iconic silhouette that exudes stealthy elegance. Wrapped in premium black nubuck, the sneaker showcases subtle accents of dark charcoal on its signature elephant print overlays. The monochromatic design is elevated by black patent leather, unique elephant print laces and minimal black and chrome branding, creating a clean yet powerful aesthetic that resonates with Jordan’s legendary \"Black Cat\" persona.<br><br>This modern interpretation of the Black Cat features updated materials, making it as functional as it is stylish. The classic Jumpman logo on the tongue and heel maintains its timeless appeal, while visible Air units in the sole provide both comfort and an enduring retro vibe. This sleek design perfectly balances contemporary flair with Jordan’s rich heritage.<br><br>Releasing on January 11, 2025, the Air Jordan 3 Retro Black Cat (2025) comes with a retail price of $200. This updated edition remains true to its roots, cementing its place as a staple for collectors and sneaker fans who value iconic design and unmatched craftsmanship.",
      "urlKey": "air-jordan-3-retro-black-cat-2025",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-3-retro-black-cat-2025"
      },
      "lowestResellPrice": {
        "stockX": 208
      }
    },
    {
      "shoeName": "Jordan 1 Low OG Rookie of the Year",
      "brand": "Jordan",
      "silhoutte": "Jordan 1 Low OG",
      "styleID": "CZ0790-107",
      "make": "Jordan 1 Low OG",
      "colorway": "Sail/Black-Golden Harvest-Gym Red",
      "retailPrice": 140,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-1-Low-OG-Rookie-of-the-Year-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2025-04-18",
      "description": "The Jordan 1 Low OG Rookie of the Year pays homage to Michael Jordan's stellar first season in the NBA. This sleek sneaker features a premium Sail leather upper, accented with Black overlays and Golden Harvest details. The iconic Swoosh logo in Gym Red adds a pop of color, while the classic Air Jordan Wings logo on the heel completes the retro look.<br><br>Designed for both style and comfort, these low-top sneakers boast the original Air cushioning in the sole, providing excellent support for everyday wear. The perforated toe box ensures breathability, while the durable rubber outsole offers superior traction on various surfaces. Our experts state this product is great for sneaker enthusiasts looking to add a piece of basketball history to their collection, combining vintage aesthetics with modern performance.",
      "urlKey": "air-jordan-1-low-og-rookie-of-the-year",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-1-low-og-rookie-of-the-year"
      },
      "lowestResellPrice": {
        "stockX": 119
      }
    },
    {
      "shoeName": "Jordan 12 Retro Flu Game (2025)",
      "brand": "Jordan",
      "silhoutte": "Jordan 12 Retro",
      "styleID": "CT8013-002",
      "make": "Jordan 12 Retro",
      "colorway": "Black/Varsity Red",
      "retailPrice": 210,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-12-Retro-Flu-Game-2025-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1740684335",
      "releaseDate": "2025-03-01",
      "description": "The Jordan 12 Retro Flu Game (2025) marks the return of one of the most legendary sneakers in basketball history. First introduced in 1997 and last seen in 2016, this colorway represents an unforgettable moment in Michael Jordan’s career. During Game 5 of the 1997 NBA Finals, MJ battled flu-like symptoms and still delivered a clutch 38-point performance, securing a vital win for the Chicago Bulls. This sneaker, draped in black and varsity red, became a symbol of perseverance, making it one of the most iconic Air Jordans ever released<br><br>Staying true to its roots, the 2025 edition features premium black tumbled leather on the upper, exuding a sleek and timeless look. The textured varsity red mudguard and midsole bring bold contrast, while signature details like the Jumpman logo on the tongue and heel tab complete the classic aesthetic. Whether you're a longtime collector or new to the game, the Flu Game 12s remain an essential piece of sneaker history.<br><br>The Jordan 12 Retro Flu Game (2025) released on March 1, 2025, for a retail price of $210. With its deep-rooted connection to one of basketball’s most legendary performances, this release continues to captivate sneakerheads and MJ fans alike.",
      "urlKey": "air-jordan-12-retro-flu-game-2025",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-12-retro-flu-game-2025"
      },
      "lowestResellPrice": {
        "stockX": 220
      }
    },
    {
      "shoeName": "Jordan 4 Retro Fear (2024)",
      "brand": "Jordan",
      "silhoutte": "Jordan 4 Retro",
      "styleID": "FQ8138-002",
      "make": "Jordan 4 Retro",
      "colorway": "Black/White/Anthracite/Black/Pure Platinum",
      "retailPrice": 215,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-4-Retro-Fear-2024-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-11-16",
      "description": "The Jordan 4 Retro Fear (2024) marks the return of one of the most anticipated releases from the Fear Pack. Originally released in 2013, the Fear Pack was designed to explore Michael Jordan’s fear of failure and his drive to overcome it. The Jordan 4 Fear stood out from the pack with its sleek black, anthracite, and pure platinum color scheme, giving the iconic silhouette a bold, edgy look. The signature flight patch on the tongue, a hallmark of the Jordan 4, emphasizes the model’s connection to MJ’s legacy and impact both on and off the court.<br><br>Crafted with a mix of premium leather and nubuck, the Jordan 4 Fear offers a perfect blend of durability and style. Its visible Air cushioning unit provides superior comfort, while the supportive design ensures the sneaker’s performance capabilities match its striking appearance. The muted black and grey tones are contrasted with white accents, making this one of the most versatile and stylish sneakers in the Jordan lineup. The Jordan 4 continues to rise in popularity, cementing its place as a fan favorite among sneakerheads.<br><br>Released on November 9, 2024, the Jordan 4 Retro Fear retailed for $215. With its timeless design and connection to Jordan’s storied legacy, this sneaker is a must-have for collectors and fashion enthusiasts alike, making it one of the most sought-after releases of the year.",
      "urlKey": "air-jordan-4-retro-fear-2024",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-4-retro-fear-2024"
      },
      "lowestResellPrice": {
        "stockX": 193
      }
    },
    {
      "shoeName": "Jordan 1 Retro High OG Black Toe Reimagined",
      "brand": "Jordan",
      "silhoutte": "Jordan 1 Retro High OG",
      "styleID": "DZ5485-106",
      "make": "Jordan 1 Retro High OG",
      "colorway": "Black/Black/Varsity Red/White",
      "retailPrice": 180,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-1-Retro-High-OG-Black-Toe-Reimagined-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2025-02-15",
      "description": "The Jordan 1 Retro High OG Black Toe Reimagined is a fresh take on one of the most iconic Air Jordan 1 colorways. The black, varsity red, and white combination is a nod to the original 1985 release that helped define sneaker culture. However, this reimagined version includes several special updates, adding a modern twist to a classic look. One of the standout features is the \"Air Jordan\" text replacing the traditional wings logo on the collar, offering a subtle but significant change.<br><br>Another striking detail is the black tongue, which contrasts against the red and white panels, along with a slightly aged-looking midsole, giving the sneaker a vintage vibe while maintaining its timeless appeal. Michael Jordan’s signature and a heartfelt message make this pair truly one of a kind. Add in a unique box featuring an image from the original Air Jordan 1 marketing campaigns, and this release is a true collector’s item.<br><br>Released in 2025, the Jordan 1 Retro High OG Black Toe Reimagined retailed for $180. With its blend of nostalgic elements and updates based on the original Air Jordan 1 High that was never released to the public, this highly anticipated release is a must-have for both longtime Jordan fans and new collectors alike.",
      "urlKey": "air-jordan-1-retro-high-og-black-toe-reimagined",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-1-retro-high-og-black-toe-reimagined"
      },
      "lowestResellPrice": {
        "stockX": 89
      }
    },
    {
      "shoeName": "Jordan 1 Retro Low OG SP Travis Scott Velvet Brown",
      "brand": "Jordan",
      "silhoutte": "Jordan 1 Retro Low OG SP",
      "styleID": "DM7866-202",
      "make": "Jordan 1 Retro Low OG SP",
      "colorway": "Dark Mocha/Black/Velvet Brown",
      "retailPrice": 150,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-1-Retro-Low-OG-SP-Travis-Scott-Velvet-Brown-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-12-21",
      "description": "The Air Jordan 1 Retro Low OG SP Travis Scott Velvet Brown is a fresh collaboration that effortlessly merges the boldness of Travis Scott’s aesthetic with the timeless allure of the Jordan 1 silhouette. Featuring a dark mocha, black, and velvet brown colorway, this sneaker embraces an earthy palette that feels both rugged and luxurious. Signature Cactus Jack branding and reverse Swoosh designs elevate the sneaker’s uniqueness, making it a must-have for collectors and fans.<br><br>Beyond aesthetics, this iteration stays true to the Air Jordan 1’s roots. The premium materials and meticulous detailing—hallmarks of Travis Scott’s collaborations—promise an experience that’s as stylish as it is functional. Whether you're pairing it with streetwear or using it to anchor a statement outfit, this design delivers unparalleled versatility.<br><br>Released on December 21, 2024, for $150, the Air Jordan 1 Retro Low OG SP Travis Scott Velvet Brown captures the perfect mix of classic and contemporary. With its earthy brown tones, this sneaker stands out as a testament to the ever-evolving art of sneaker design.",
      "urlKey": "air-jordan-1-retro-low-og-sp-travis-scott-velvet-brown",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-1-retro-low-og-sp-travis-scott-velvet-brown"
      },
      "lowestResellPrice": {
        "stockX": 233
      }
    },
    {
      "shoeName": "Jordan 5 Retro OG Black Metallic Reimagined",
      "brand": "Jordan",
      "silhoutte": "Jordan 5 Retro OG",
      "styleID": "HF3975-001",
      "make": "Jordan 5 Retro OG",
      "colorway": "Black/White-Metallic Silver-Fire Red",
      "retailPrice": 210,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-5-Retro-OG-Black-Metallic-Reimagined-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738617131",
      "releaseDate": "2025-02-08",
      "description": "The Air Jordan 5 Retro OG Black Metallic Reimagined pays homage to one of Jordan Brand’s most iconic designs, first debuted in 1990. This updated version reimagines the timeless sneaker with subtle yet impactful modern tweaks, staying true to its legendary roots. Featuring a sleek black nubuck upper, reflective metallic silver tongues, and bold fire red accents on the Jumpman logo, this sneaker effortlessly blends heritage with innovation.<br><br>Every detail has been carefully crafted to elevate its legacy. The 3M reflective tongue and metallic silver shark teeth on the midsole add depth and dimension, while translucent netting and a visible Air unit in the heel enhance both style and comfort. Beloved touches like the \"Nike Air\" branding on the heel  and upside-down \"Air Jordan\" text inside the tongue provide nostalgic nods to the original design while keeping the sneaker relevant.<br><br>Released on February 8, 2025,the Air Jordan 5 Black Metallic Reimagined retailed for $210. This version marks the 35th anniversary of the silhouette and is part of Jordan Brand’s highly anticipated Reimagined lineup, giving both longtime fans and newcomers a fresh reason to celebrate.",
      "urlKey": "air-jordan-5-retro-og-black-metallic-reimagined",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-5-retro-og-black-metallic-reimagined"
      },
      "lowestResellPrice": {
        "stockX": 236
      }
    },
    {
      "shoeName": "Jordan 3 Retro OG Black Cement (2024)",
      "brand": "Jordan",
      "silhoutte": "Jordan 3 Retro OG",
      "styleID": "DN3707-010",
      "make": "Jordan 3 Retro OG",
      "colorway": "Black/Fire Red/Cement Grey/Sail",
      "retailPrice": 220,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-3-Retro-Black-Cement-Reimagined-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-11-23",
      "description": "The Jordan 3 Retro OG Black Cement (2024) is one of the most hyped and sought after sneakers of 2024, making it one of the hottest drops of the holiday season. <br><br> Originally making it's debut in 1988, this colorway has become iconic in the sneaker community and is one of the most timeless designs in the entire Jordan Brand line.These sneakers famously made their debut on Jordan's feet during the 1988 All-Star Game. The Black Cement 3s last released as a retro in 2018. <br><br> The Jordan 3 Retro OG Black Cement released on November 23rd, 2024, for a retail price of $220. Our experts love the Black Cement 3s due to their storied history and iconic color blocking, making them one of the most classic sneakers in the history of sneakerhead culture.",
      "urlKey": "air-jordan-3-retro-black-cement-2024",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-3-retro-black-cement-2024"
      },
      "lowestResellPrice": {
        "stockX": 173
      }
    },
    {
      "shoeName": "Jordan 3 Retro OG Rare Air",
      "brand": "Jordan",
      "silhoutte": "Jordan 3 Retro OG",
      "styleID": "IB8967-004",
      "make": "Jordan 3 Retro OG",
      "colorway": "Black/Chile Red/Neutral Grey/Military Blue/Coconut Milk",
      "retailPrice": 210,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-3-Retro-OG-Rare-Air-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1743628196",
      "releaseDate": "2025-05-30",
      "description": "",
      "urlKey": "air-jordan-3-retro-og-rare-air",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-3-retro-og-rare-air"
      },
      "lowestResellPrice": {
        "stockX": 196
      }
    },
    {
      "shoeName": "Jordan 4 Retro Military Blue (2024)",
      "brand": "Jordan",
      "silhoutte": "Jordan 4 Retro",
      "styleID": "FV5029-141",
      "make": "Jordan 4 Retro",
      "colorway": "Off-White/Military Blue/Neutral Grey",
      "retailPrice": 215,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-4-Retro-Military-Blue-2024-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-05-04",
      "description": "The Air Jordan 4 Retro Military Blue 2024 stands as a beacon of Jordan Brand's innovation and style. It features an off-white leather base contrasted with the striking military blue splashed on the eyelet wings, heel, and parts of the midsole, creating a look of disciplined yet daring design. The neutral grey touches on the forefoot and outsole balance the aesthetic, highlighting the sneaker's clean lines and geometric shapes.<br><br>Every detail is meticulously crafted, with the Jumpman logo on the tongue, the 'Flight' script on the tongue's underside, and a visible Air-Sole unit encased in the sole—all of which are hallmarks of the Jordan brand's dedication to quality and performance. The industrial blue mesh inserts not only offer breathability but also complement the sneaker's color scheme, adding both function and flair. The beloved Nike Air logo graces the heel and stays true to the original 1989 iteration.<br><br>Released on May 4, 2024, at a retail price of $215, the Air Jordan 4 Retro Military Blue quickly ascended to iconic status. Collectors and sneaker enthusiasts eagerly celebrated the revival of the military blue colorway on a timeless model.",
      "urlKey": "air-jordan-4-retro-military-blue-2024",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-4-retro-military-blue-2024"
      },
      "lowestResellPrice": {
        "stockX": 181
      }
    },
    {
      "shoeName": "Air Jordan 4 Retro OG SP Nigel Sylvester Brick by Brick",
      "brand": "Jordan",
      "silhoutte": "Air Jordan 4 Retro OG SP",
      "styleID": "HF4340-800",
      "make": "Air Jordan 4 Retro OG SP",
      "colorway": "Firewood Orange/Sail-Cinnabar",
      "retailPrice": 225,
      "thumbnail": "https://images.stockx.com/images/Air-Air-Jordan-4-Retro-OG-SP-Nigel-Sylvester-Bike-Air-Firewood-Orange-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1741209000",
      "releaseDate": "2025-03-14",
      "description": "The Air Jordan 4 Retro OG SP Nigel Sylvester Brick by Brick is a tribute to NYC's red-bricked streets, where Nigel Sylvester honed his BMX skills. As a long-time Jordan Brand collaborator, Sylvester fuses his love for biking with sneaker culture, crafting a bold design that reflects his journey. The firewood orange suede upper and sail midsole deliver a striking contrast, while the Bike Air branding on the heel adds a unique twist to the traditional Nike Air logo.<br><br>Details like the mini embroidered Swoosh on the forefoot, reflective 3M accents, and a worn-in aesthetic set this collaboration apart. The rugged build ensures durability for both BMX riders and streetwear enthusiasts alike. Sylvester's storytelling approach extends to the special packaging, reinforcing the \"Brick by Brick\" theme that symbolizes his rise.<br><br>Released on March 14, 2025, for a retail price of $225, the Air Jordan 4 Retro OG SP Nigel Sylvester Brick by Brick continues Sylvester's legacy of merging BMX culture with high-profile sneaker collaborations. Whether you're riding or collecting, this drop is built to turn heads.",
      "urlKey": "air-air-jordan-4-retro-og-sp-nigel-sylvester-bike-air-firewood-orange",
      "resellLinks": {
        "stockX": "https://stockx.com/air-air-jordan-4-retro-og-sp-nigel-sylvester-bike-air-firewood-orange"
      },
      "lowestResellPrice": {
        "stockX": 322
      }
    },
    {
      "shoeName": "Jordan 4 Retro Seafoam Sail (Women's)",
      "brand": "Jordan",
      "silhoutte": "Jordan 4 Retro",
      "styleID": "HV0823-003",
      "make": "Jordan 4 Retro",
      "colorway": "Seafoam/Sail/Metallic Silver",
      "retailPrice": 215,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-4-Retro-Seafoam-Sail-Womens-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2025-03-08",
      "description": "",
      "urlKey": "air-jordan-4-retro-seafoam-sail-womens",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-4-retro-seafoam-sail-womens"
      },
      "lowestResellPrice": {
        "stockX": 129
      }
    },
    {
      "shoeName": "Jordan 1 Retro High OG UNC Reimagined",
      "brand": "Jordan",
      "silhoutte": "Jordan 1 Retro High OG",
      "styleID": "DZ5485-402",
      "make": "Jordan 1 Retro High OG",
      "colorway": "Dark Powder Blue/Dark Powder Blue-Sail",
      "retailPrice": 180,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-1-Retro-High-OG-UNC-Reimagined-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1744933337",
      "releaseDate": "2025-05-10",
      "description": "The Jordan 1 Retro High OG UNC Reimagined brings classic energy back with a twist that feels straight out of the vault. Inspired by the University of North Carolina’s iconic blue and white palette, this version adds a nostalgic spin by incorporating cracked leather overlays and an aged midsole finish. It’s a nod to the past while still moving things forward—balancing vintage appeal with modern-day edge.<br><br>What really elevates this pair is the packaging. The box alone tells a story: distressed orange on the bottom, black and red on the lid, mimicking the mismatched look of something unearthed in a forgotten storage room. It's a subtle flip on 2022's \"Lost and Found\" release that collectors will appreciate. Every detail from the sail-colored midsole to the powder blue overlays adds to the worn-in, loved feel—like it’s been waiting decades to be laced up again.<br><br>The Jordan 1 Retro High OG UNC Reimagined released on May 10, 2025, for a retail price of $180. The colorway blends dark powder blue and sail, keeping the UNC spirit alive with just the right amount of wear and tear built in.",
      "urlKey": "air-jordan-1-retro-high-og-unc-reimagined",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-1-retro-high-og-unc-reimagined"
      },
      "lowestResellPrice": {
        "stockX": 192
      }
    },
    {
      "shoeName": "Jordan 1 Retro Low OG SP Travis Scott Medium Olive",
      "brand": "Jordan",
      "silhoutte": "Jordan 1 Retro Low OG SP",
      "styleID": "DM7866-200",
      "make": "Jordan 1 Retro Low OG SP",
      "colorway": "Medium Olive/Black/Sail/Muslin",
      "retailPrice": 150,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-1-Retro-Low-OG-SP-Medium-Olive-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1741099152",
      "releaseDate": "2024-09-28",
      "description": "The Jordan 1 Retro Low OG SP Travis Scott Medium Olive continues the highly coveted collaboration between Jordan Brand and Travis Scott, offering sneakerheads a fresh take on a classic silhouette. Dressed in a striking colorway of medium olive, black, sail, and muslin, this low-top design is instantly recognizable with its iconic reverse swoosh, a signature element of the Travis Scott x Jordan partnership. The premium leather and suede construction provides a tactile contrast, while the standout red Jordan wings logo on the heel and the Cactus Jack branding on the medial side elevate the sneaker’s distinctive style.<br><br>Travis Scott’s collaboration with Jordan has had an undeniable influence on sneaker culture, making each new release a must-have for collectors. The reverse swoosh, initially introduced with the first collaboration, has become synonymous with the Travis Scott brand, and this Jordan 1 Low model amplifies that signature aesthetic. Alongside the bold swoosh, other details like the sail midsole, muslin accents, and custom Travis Scott logos give the sneaker a blend of vintage appeal and modern streetwear edge, making it a versatile option for any look.<br><br>Released on September 28, 2024, the Jordan 1 Retro Low OG SP Travis Scott Medium Olive retailed at $150. This medium olive, black, sail, and muslin colorway continues to build on the legacy of the Jordan x Travis Scott collaboration, offering a sneaker that is a key piece of today’s sneaker fashion. Whether you're a dedicated Jordan collector or a fan of streetwear culture, this release is sure to make a statement.",
      "urlKey": "air-jordan-1-retro-low-og-sp-travis-scott-medium-olive",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-1-retro-low-og-sp-travis-scott-medium-olive"
      },
      "lowestResellPrice": {
        "stockX": 433
      }
    }
  ]