[
    {
      "shoeName": "Jordan Jumpman Jack TR Travis Scott Bright Cactus",
      "brand": "Jordan",
      "silhoutte": "Jordan Jumpman Jack TR",
      "styleID": "FZ8117-102",
      "make": "Jordan Jumpman Jack TR",
      "colorway": "Muslin/Black/Bright Cactus",
      "retailPrice": 200,
      "thumbnail": "https://images.stockx.com/images/air-jordan-jumpman-jack-tr-travis-scott-bright-cactus.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1745503228",
      "releaseDate": "2025-04-30",
      "description": "Please Note: Dust bag is not required",
      "urlKey": "air-jordan-jumpman-jack-tr-travis-scott-bright-cactus",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-jumpman-jack-tr-travis-scott-bright-cactus"
      },
      "lowestResellPrice": {
        "stockX": 305
      }
    },
    {
      "shoeName": "Jordan 1 Retro Low OG SP Travis Scott Velvet Brown",
      "brand": "Jordan",
      "silhoutte": "Jordan 1 Retro Low OG SP",
      "styleID": "DM7866-202",
      "make": "Jordan 1 Retro Low OG SP",
      "colorway": "Dark Mocha/Black/Velvet Brown",
      "retailPrice": 150,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-1-Retro-Low-OG-SP-Travis-Scott-Velvet-Brown-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-12-21",
      "description": "The Air Jordan 1 Retro Low OG SP Travis Scott Velvet Brown is a fresh collaboration that effortlessly merges the boldness of Travis Scott’s aesthetic with the timeless allure of the Jordan 1 silhouette. Featuring a dark mocha, black, and velvet brown colorway, this sneaker embraces an earthy palette that feels both rugged and luxurious. Signature Cactus Jack branding and reverse Swoosh designs elevate the sneaker’s uniqueness, making it a must-have for collectors and fans.<br><br>Beyond aesthetics, this iteration stays true to the Air Jordan 1’s roots. The premium materials and meticulous detailing—hallmarks of Travis Scott’s collaborations—promise an experience that’s as stylish as it is functional. Whether you're pairing it with streetwear or using it to anchor a statement outfit, this design delivers unparalleled versatility.<br><br>Released on December 21, 2024, for $150, the Air Jordan 1 Retro Low OG SP Travis Scott Velvet Brown captures the perfect mix of classic and contemporary. With its earthy brown tones, this sneaker stands out as a testament to the ever-evolving art of sneaker design.",
      "urlKey": "air-jordan-1-retro-low-og-sp-travis-scott-velvet-brown",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-1-retro-low-og-sp-travis-scott-velvet-brown"
      },
      "lowestResellPrice": {
        "stockX": 233
      }
    },
    {
      "shoeName": "Jordan 1 Retro Low OG SP Travis Scott Medium Olive",
      "brand": "Jordan",
      "silhoutte": "Jordan 1 Retro Low OG SP",
      "styleID": "DM7866-200",
      "make": "Jordan 1 Retro Low OG SP",
      "colorway": "Medium Olive/Black/Sail/Muslin",
      "retailPrice": 150,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-1-Retro-Low-OG-SP-Medium-Olive-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1741099152",
      "releaseDate": "2024-09-28",
      "description": "The Jordan 1 Retro Low OG SP Travis Scott Medium Olive continues the highly coveted collaboration between Jordan Brand and Travis Scott, offering sneakerheads a fresh take on a classic silhouette. Dressed in a striking colorway of medium olive, black, sail, and muslin, this low-top design is instantly recognizable with its iconic reverse swoosh, a signature element of the Travis Scott x Jordan partnership. The premium leather and suede construction provides a tactile contrast, while the standout red Jordan wings logo on the heel and the Cactus Jack branding on the medial side elevate the sneaker’s distinctive style.<br><br>Travis Scott’s collaboration with Jordan has had an undeniable influence on sneaker culture, making each new release a must-have for collectors. The reverse swoosh, initially introduced with the first collaboration, has become synonymous with the Travis Scott brand, and this Jordan 1 Low model amplifies that signature aesthetic. Alongside the bold swoosh, other details like the sail midsole, muslin accents, and custom Travis Scott logos give the sneaker a blend of vintage appeal and modern streetwear edge, making it a versatile option for any look.<br><br>Released on September 28, 2024, the Jordan 1 Retro Low OG SP Travis Scott Medium Olive retailed at $150. This medium olive, black, sail, and muslin colorway continues to build on the legacy of the Jordan x Travis Scott collaboration, offering a sneaker that is a key piece of today’s sneaker fashion. Whether you're a dedicated Jordan collector or a fan of streetwear culture, this release is sure to make a statement.",
      "urlKey": "air-jordan-1-retro-low-og-sp-travis-scott-medium-olive",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-1-retro-low-og-sp-travis-scott-medium-olive"
      },
      "lowestResellPrice": {
        "stockX": 433
      }
    },
    {
      "shoeName": "Jordan Jumpman Jack TR Travis Scott Dark Mocha",
      "brand": "Jordan",
      "silhoutte": "Jordan Jumpman Jack TR",
      "styleID": "FZ8117-204",
      "make": "Jordan Jumpman Jack TR",
      "colorway": "Dark Mocha/Black-Sail",
      "retailPrice": 200,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-Cut-The-Check-TR-Travis-Scott-Mocha-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-11-26",
      "description": "The Air Jordan Jumpman Jack TR Travis Scott Dark Mocha, also known as the Jordan CJ1 T-Rexx, is the third colorway of Travis Scott's signature sneaker model, the Jumpman Jack. <br><br> This Dark Mocha colorway features and all black and brown design with a velcro tongue flap, reverse swoosh branding, and the Air Jordan logo on the tongue. The underside of the sneaker also showcases unique Cactus Jack branding. This colorway is by far the most neutral and muted colorway of the Jumpman Jack so far, making it a versatile sneaker for many different occasion. As Travis Scott continues to ascend to new heights, his sneakers and surely set to become as hot as ever. <br><br> The Air Jordan Jumpman Jack TR Travis Scott Dark Mocha released on November 26th, 2024, for a retail price of $200. We love this sneaker due to it's iconic Cactus Jack branding and recognizable style in the world of sneakers. <br><br> Please Note: Dust bag is not required",
      "urlKey": "air-jordan-cut-the-check-tr-travis-scott-mocha",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-cut-the-check-tr-travis-scott-mocha"
      },
      "lowestResellPrice": {
        "stockX": 194
      }
    },
    {
      "shoeName": "Jordan 1 Retro Low OG SP Travis Scott Canary (Women's)",
      "brand": "Jordan",
      "silhoutte": "Jordan 1 Retro Low OG SP",
      "styleID": "DZ4137-700",
      "make": "Jordan 1 Retro Low OG SP",
      "colorway": "Canary/Racer Blue/Light Silver/Gum Medium Brown",
      "retailPrice": 150,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-1-Retro-Low-OG-SP-Travis-Scott-Canary-Womens-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-05-25",
      "description": "Immerse yourself in the stylish and bold world of the Jordan 1 Retro Low OG SP Travis Scott Canary (Women's), a sneaker that brings a fresh vibe to a classic silhouette. This edition is splashed in Canary, Racer Blue, and Light Silver hues, embodying the energy of Travis Scott's alma mater, Elkins High School. The sneaker’s design is highlighted by the iconic reversed Swoosh, a hallmark of Travis Scott’s transformative touch to the Jordan 1 & sneaker culture. Adorned with the Cactus Jack logo, these sneakers are a true testament to the rapper's influence and aesthetic.<br><br>The Jordan 1 Retro Low OG SP Travis Scott Canary is a piece of wearable art. Crafted with premium materials for comfort and durability, the design also features a gum medium brown outsole that complements the vibrant upper, ensuring these shoes stand out in any crowd. The combination of Travis Scott's unique style and Jordan Brand's legendary craftsmanship offers wearers a mix of street-worthy appeal and high-fashion sensibility.<br><br>Released on May 17, 2024, the Jordan 1 Retro Low OG SP Travis Scott Canary (Women's) was retailed for $150. Each pair reflects the spirit of innovation and youth, capturing the essence of Travis Scott's creative vision and the enduring legacy of the Jordan brand. With each step, wearers celebrate a legacy of musical prowess and sneaker history, making it a coveted addition to any collection.",
      "urlKey": "air-jordan-1-retro-low-og-sp-travis-scott-canary-womens",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-1-retro-low-og-sp-travis-scott-canary-womens"
      },
      "lowestResellPrice": {
        "stockX": 265
      }
    },
    {
      "shoeName": "Nike Zoom Field Jaxx Travis Scott Light Chocolate",
      "brand": "Nike",
      "silhoutte": "Nike Zoom Field Jaxx",
      "styleID": "HQ3073-100",
      "make": "Nike Zoom Field Jaxx",
      "colorway": "White/Light Chocolate",
      "retailPrice": 170,
      "thumbnail": "https://images.stockx.com/images/Nike-Zoom-Field-Jaxx-Travis-Scott-Light-Chocolate-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2025-01-31",
      "description": "The Nike Zoom Field Jaxx Travis Scott Light Chocolate is a performance shoe designed in collaboration with American rapper Travis Scott.\n<br> \n<br>\nThe Travis Scott Light Chocolate Nike Zoom Field Jaxx features an off-white mesh base thickly woven for extra visual texture. This mesh makes up the toe box and sides. White leather overlays form the toe cap, mudguard, eyestays, ankle strap, and heel area, while the mudguard is separated from the rest by a thin cream strip. A forefoot strap also appears over the laces in white leather, while Shark branding is seen underneath it on the inner side. The Nike swoosh crosses the sides in a Light Chocolate brown color, while the tongue also bears Cactus Jack branding in Light Chocolate. The Nike swoosh appears as the mouth inside a drawn face on the heel, and the shoe sits on a branded brown midsole complete with Air technology.\n<br>\n<br>\nWhat we like best about this sneaker is the unique branding, including the face on the heel. The Nike Zoom Field Jaxx Travis Scott Light Chocolate will be released in January 2025 for $170.",
      "urlKey": "nike-zoom-field-jaxx-travis-scott-light-chocolate",
      "resellLinks": {
        "stockX": "https://stockx.com/nike-zoom-field-jaxx-travis-scott-light-chocolate"
      },
      "lowestResellPrice": {
        "stockX": 86
      }
    },
    {
      "shoeName": "Jordan 1 Retro Low OG SP Travis Scott Olive (Women's)",
      "brand": "Jordan",
      "silhoutte": "Jordan 1 Retro Low OG SP",
      "styleID": "DZ4137-106",
      "make": "Jordan 1 Retro Low OG SP",
      "colorway": "Sail/University Red/Black/Medium Olive",
      "retailPrice": 150,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-1-Retro-Low-OG-SP-Travis-Scott-Olive-W-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2023-04-26",
      "description": "Travis Scott is back in 2023, following up his previous release of the Air Jordan 1 Retro Low Phantom in 2022, with another Air Jordan 1 Retro Low collaboration. The Jordan 1 Retro low OG SP Travis Scott Olive released exclusively in womens sizing. \n<br>\n<br>\nThe Air Jordan 1 Low OG SP Travis Scott Olive is constructed with white leather and black nubuck uppers. Travis continued to use his signautre reverse style Nike Swoosh, in an olive green colorway. The limited edition sneakers have an aged midsole that sits on top of an olive green outsole. \n<br>\n<br>\nThe women's-exclusive Air Jordan 1 Retro Low OG SP Travis Scott Olive released April 26, 2023, with a retail price of $150. ",
      "urlKey": "air-jordan-1-retro-low-og-sp-travis-scott-olive-w",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-1-retro-low-og-sp-travis-scott-olive-w"
      },
      "lowestResellPrice": {
        "stockX": 429
      }
    },
    {
      "shoeName": "Nike Air Force 1 Low '07 White (Travis Scott Cactus Jack Utopia Edition)",
      "brand": "Nike",
      "silhoutte": "Nike Air Force 1 Low '07",
      "styleID": "CW2288-111/TSUT-AF01",
      "make": "Nike Air Force 1 Low '07",
      "colorway": "White/White",
      "retailPrice": 150,
      "thumbnail": "https://images.stockx.com/images/Nike-Air-Force-1-Low-07-White-Travis-Scott-Cactus-Jack-Utopia-Edition-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2023-07-28",
      "description": "Unveiled on July 28, 2023, the Nike Air Force 1 Low Travis Scott Cactus Jack Utopia Edition is more than just a sneaker; it's the embodiment of Travis’ creative genius, this shoe echoes with the sounds and themes of his groundbreaking album, 'Utopia’.\n<br>\n<br>\nRadiating in a dominant all-white shade, this iconic silhouette carries the legacy of the Air Force 1 with a touch of Travis Scott's unique artistry. Crafted with precision, the sneaker showcases the word 'Utopia' imprinted on its heel - a direct nod to Scott's most recent album.\n<br>\n<br>\nBut there's more. The Utopia graphic doesn't just serve aesthetic vibes; it’s a celebration of music and streetwear colliding. The fusion of leather and subtle design details crafts an aesthetic that's both sleek and statement-making. Dive into the Utopia with this pair of sneakers that retailed at $150.\n<br>\n<br>\nPlease note: by listing this item for sale, you agree to ship within the normal shipping window. Shipping deadlines will not be extended to accommodate shipping delays from the retailer.",
      "urlKey": "nike-air-force-1-low-07-white-travis-scott-cactus-jack-utopia-edition",
      "resellLinks": {
        "stockX": "https://stockx.com/nike-air-force-1-low-07-white-travis-scott-cactus-jack-utopia-edition"
      },
      "lowestResellPrice": {
        "stockX": 130
      }
    },
    {
      "shoeName": "Jordan Jumpman Jack TR Travis Scott University Red",
      "brand": "Jordan",
      "silhoutte": "Jordan Jumpman Jack TR",
      "styleID": "FZ8117-101",
      "make": "Jordan Jumpman Jack TR",
      "colorway": "Sail/University Red-Black-Muslin",
      "retailPrice": 200,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-Jumpman-Jack-TR-Travis-Scott-University-Red-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-05-10",
      "description": "The release of the Air Jordan Jumpman Jack TR Travis Scott University Red marks a momentous occasion: the first wide public launch of a brand-new, original colorway from the collaborative genius of Jordan Brand and Travis Scott. This sneaker is a homage to the past and a forward leap in design, drawing inspiration from classic basketball sneakers of the '80s and the rugged aesthetic of '90s skate shoes. It’s a perfect blend for enthusiasts who appreciate a retro vibe with a modern twist.<br><br>Travis Scott's first entirely original silhouette comes to life with the iconic, signature reversed Nike Swoosh in a bold university red, contrasting strikingly against the timeless sail & black upper. The carefully pre-yellowed midsole adds a touch of vintage appeal, invoking a sense of nostalgia while remaining at the pinnacle of style. Complete with a special co-branded shoe box and dust bag, the Jordan Jumpman Jack TR is as much a collector's piece as it is a testament to sneaker innovation.<br><br>Released on April 26, 2024, the Air Jordan Jumpman Jack TR Travis Scott University Red retailed for $200. This sneaker is the inception of Travis Scott's original design legacy, offering a unique take on sneaker culture. With its rich 80s and 90s influences and the unmatched Travis Scott brand power, this sneaker is ready to conquer the streets and capture the essence of both basketball and skateboarding heritage.",
      "urlKey": "air-jordan-jumpman-jack-tr-travis-scott-university-red",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-jumpman-jack-tr-travis-scott-university-red"
      },
      "lowestResellPrice": {
        "stockX": 200
      }
    },
    {
      "shoeName": "Jordan 1 Retro Low OG SP Travis Scott Medium Olive (TD)",
      "brand": "Jordan",
      "silhoutte": "Jordan 1 Retro Low OG SP",
      "styleID": "DO5441-200",
      "make": "Jordan 1 Retro Low OG SP",
      "colorway": "Medium Olive/Black/Sail/Muslin",
      "retailPrice": 50,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-1-Retro-Low-OG-SP-Medium-Olive-TD-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-09-28",
      "description": "The Jordan 1 Retro Low OG SP Travis Scott Medium Olive (TD), in toddler sizes, is a low-top athletic shoe featuring a Medium Olive leather upper contrasted by Sail overlays and the Swoosh in black, placed in a reverse orientation. In red, the Nike, Travis Scott, and Jordan Wings logos accent the tongue and heel. The Muslin midsole and Medium Olive outsole complete the aesthetic.\n<br>\n<br>\nThe Air Jordan 1 is one of the American athletic shoe brand Nike’s crowning achievements for its unparalleled longevity and popularity. Travis Scott is a rapper, producer, and songwriter from Houston, Texas, whose records have topped charts since the 20-teens. Nike tapped Scott to apply his signature aesthetic to the Jordan 1 Retro, one of their iconic styles. The shoe comes with accessories, like pink and black laces.\n<br>\n<br>\nOur experts feel that the best features of the Jordan 1 Retro Medium Olive are the rounded toe cap, sole pattern, and ventilation holes of this limited-edition shoe. The Jordan 1 Retro Low OG SP Travis Scott Medium Olive (TD) was released on September 28, 2024, and retailed at $50.",
      "urlKey": "air-jordan-1-retro-low-og-sp-travis-scott-medium-olive-td",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-1-retro-low-og-sp-travis-scott-medium-olive-td"
      },
      "lowestResellPrice": {
        "stockX": 115
      }
    },
    {
      "shoeName": "Jordan 1 Retro Low OG SP Travis Scott Black Phantom",
      "brand": "Jordan",
      "silhoutte": "Jordan 1 Retro Low OG SP",
      "styleID": "DM7866-001",
      "make": "Jordan 1 Retro Low OG SP",
      "colorway": "Black/Phantom-Ale Brown-Racer Blue-Team Orange",
      "retailPrice": 150,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-1-Retro-Low-OG-SP-Travis-Scott-Black-Phantom-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2022-12-15",
      "description": "Travis Scott closed out 2022 with the return of his signature Jordan 1 Low, this time in a new Black Phantom colorway. <br> <br> The silhouette returned with his signature backwards Nike Swoosh but with a new contrast stitch design. The all black nubuck sneakers feature a Nike Air logo on the tongue and an Air Jordan Wings logo on the right heel tab. Red, Black, and White/Black laces are included and an embroidered Bee is located on the heel tab of the left sneaker inspired by Travis’ daughter, Stormi. <br> <br> The Air Jordan 1 Retro Low OG SP Travis Scott Black Phantom released December 15, 2022 with a retail price of $150.",
      "urlKey": "air-jordan-1-retro-low-og-sp-travis-scott-black-phantom",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-1-retro-low-og-sp-travis-scott-black-phantom"
      },
      "lowestResellPrice": {
        "stockX": 615
      }
    },
    {
      "shoeName": "Nike Air Max 1 Travis Scott Cactus Jack Saturn Gold",
      "brand": "Nike",
      "silhoutte": "Nike Air Max 1",
      "styleID": "DO9392-700",
      "make": "Nike Air Max 1",
      "colorway": "Saturn Gold/Tea Tree Mist/Tent",
      "retailPrice": 150,
      "thumbnail": "https://images.stockx.com/images/Nike-Air-Max-1-Travis-Scott-Wheat-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2022-05-27",
      "description": "In collaboration with Travis Scott's record label Cactus Jack, the Nike Air Max 1 Travis Scott Cactus Jack Saturn Gold pays homage to outdoor exploration and the Nike ACG Pocket Knife hiking shoe. It boasts a light yellow layered mesh upper with matching Durabuck overlays and reversed Swoosh logos. A drawstring Gillie lacing system nods to common features on trail runners. At the base, a yellowed sole with a cloudy Air unit adds the finishing touch.\n<br>\n<br>\nThe Nike Air Max 1 Travis Scott Cactus Jack Saturn Gold released in May of 2022 and retailed for $150.",
      "urlKey": "nike-air-max-1-travis-scott-wheat",
      "resellLinks": {
        "stockX": "https://stockx.com/nike-air-max-1-travis-scott-wheat"
      },
      "lowestResellPrice": {
        "stockX": 139
      }
    },
    {
      "shoeName": "Jordan 1 Retro Low OG SP Fragment x Travis Scott",
      "brand": "Jordan",
      "silhoutte": "Jordan 1 Retro Low OG SP",
      "styleID": "DM7866-140",
      "make": "Jordan 1 Retro Low OG SP",
      "colorway": "White/Black-Royal-Sail",
      "retailPrice": 150,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-1-Low-fragment-design-x-Travis-Scott-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2021-08-13",
      "description": "The Air Jordan 1 Low Fragment Design x Travis Scott nods to the original 2016 Air Jordan 1 Fragment with its simple color blocking. It features a smooth white leather upper with black and royal blue leather overlays. From there, a signature reversed Swoosh and yellowed soles add a Cactus Jack flair to the classic silhouette.\n<br>\n<br>\nThe Air Jordan 1 Low Fragment Design x Travis Scott released in August of 2021 and retailed for $150.",
      "urlKey": "air-jordan-1-low-fragment-design-x-travis-scott",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-1-low-fragment-design-x-travis-scott"
      },
      "lowestResellPrice": {
        "stockX": 1145
      }
    },
    {
      "shoeName": "Jordan 6 Retro Travis Scott",
      "brand": "Jordan",
      "silhoutte": "Jordan 6 Retro",
      "styleID": "CN1084-200",
      "make": "Jordan 6 Retro",
      "colorway": "Medium Olive/Black-Sail-University Red",
      "retailPrice": 250,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-6-Retro-Travis-Scott-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2019-10-11",
      "description": "Trailing the buzz of their recent collaborations, Travis Scott and Jordan Brand team up once again for the Jordan 6 Retro Travis Scott, now available on StockX. This is the fourth Air Jordan silhouette that Cactus Jack has touched. This sneaker made its mainstream debut when Travis rocked them on stage during his Super Bowl LIII performance and the rest is history.\n<br>\n<br>\nThis AJ 6 features an olive upper with black detailing and red contrasting accents on the tongue and lace locks. A side cargo pocket is displayed on the collar, giving this sneaker a design modification that makes it the first of its kind. A sail midsole, glow-in-the-dark translucent outsole, 3M detailing and both Nike Air and Cactus Jack branding on the heel completes the design. These sneakers released in October of 2019 for $250.",
      "urlKey": "air-jordan-6-retro-travis-scott",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-6-retro-travis-scott"
      },
      "lowestResellPrice": {
        "stockX": 340
      }
    },
    {
      "shoeName": "Jordan 1 Retro Low OG SP Travis Scott Medium Olive (PS)",
      "brand": "Jordan",
      "silhoutte": "Jordan 1 Retro Low OG SP",
      "styleID": "DO5442-200",
      "make": "Jordan 1 Retro Low OG SP",
      "colorway": "Medium Olive/Black/Sail/Muslin",
      "retailPrice": 60,
      "thumbnail": "https://images.stockx.com/images/Air-Jordan-1-Retro-Low-OG-SP-Medium-Olive-PS-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-09-28",
      "description": "The Jordan 1 Retro Low OG SP Travis Scott Medium Olive (PS), in pre-school sizes, is an athletic shoe with a low-top silhouette. The leather upper is done in Medium Olive overlaid with Sail at the tip, lace panel, and heel, accented by a reversed Swoosh in black. Travis Scott and Jordan wings branding accents the heel, while the Nike branding appears on the tongue. The midsole and outsole combo in Muslin and Medium Olive completes the look.\n<br>\n<br>\nNike introduced the Air Jordan 1 to the public in 1985 after designing it for Michael Jordan in 1984, and from there, the shoe went on to have legendary status. Classic and iconic, the Jordan 1 retro has been reimagined in myriad variations. In 2024, Nike worked with Houston, Texas-based artist Travis Scott on his signature Jordan 1 Retro, which features his stitched mouth-face artwork.\n<br>\n<br>\nIn our opinion, the Retro Low OG SP's best feature is its unusual branding and stitching, which distinguish it from other models. The Jordan 1 Retro Low OG SP Travis Scott Medium Olive (PS) was released on September 28, 2024, and retailed for $60.",
      "urlKey": "air-jordan-1-retro-low-og-sp-travis-scott-medium-olive-ps",
      "resellLinks": {
        "stockX": "https://stockx.com/air-jordan-1-retro-low-og-sp-travis-scott-medium-olive-ps"
      },
      "lowestResellPrice": {
        "stockX": 135
      }
    }
  ]