[
    {
      "shoeName": "adidas Yeezy Slide Onyx",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Slide",
      "styleID": "HQ6448",
      "make": "adidas Yeezy Slide",
      "colorway": "Onyx/Onyx/Onyx",
      "retailPrice": 60,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Slide-Black-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2022-03-07",
      "description": "First revealed in February 2022 at the Donda 2 listening event in Miami, the adidas Yeezy Slide Onyx features an all-black foam construction with a soft footbed for comfort. At the base, a grooved outsole adds stability and responsiveness.\n<br>\n<br>\nThe adidas Yeezy Slide Onyx released in March of 2022 and retailed for $60.",
      "urlKey": "adidas-yeezy-slide-black-onyx",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-slide-black-onyx"
      },
      "lowestResellPrice": {
        "stockX": 118
      }
    },
    {
      "shoeName": "adidas Yeezy Slide Slate Marine",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Slide",
      "styleID": "ID2349",
      "make": "adidas Yeezy Slide",
      "colorway": "Slate Marine/Slate Marine/Slate Marine",
      "retailPrice": 70,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Slide-Slate-Marine-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2023-08-11",
      "description": "The adidas Yeezy Slide in Slate Marine showcases an unprecedented combination of style and comfort. The slate marine colorway released on August 11, 2023. A deviation from the norm, this slide presents a sculpted yet sleek design, dominated by a bold, Slate Marine hue.\n<br>\n<br>\nThis slide comes dressed in a captivating Slate Marine color scheme. The minimalistic approach  creates a modern silhouette that's both trendy and comfortable. The slides feature a characteristic adidas marking on the footbed, as well as the Yeezy imprint subtly incorporated, adding a splash of exclusivity to your step.\n<br>\n<br>\nWhat we love about the Yeezy Slide design is the cloud-like cushioning that effortlessly molds to your foot, offering an unparalleled comfort experience. This cool slide effortlessly blends comfort with chic aesthetics. The adidas Yeezy Slide in Slate Marine was launched on August 11, 2023, retailing at a cool $70.",
      "urlKey": "adidas-yeezy-slide-slate-marine",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-slide-slate-marine"
      },
      "lowestResellPrice": {
        "stockX": 88
      }
    },
    {
      "shoeName": "adidas Yeezy Foam RNR Onyx",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Foam RNR",
      "styleID": "HP8739",
      "make": "adidas Yeezy Foam RNR",
      "colorway": "Onyx/Onyx/Onyx",
      "retailPrice": 90,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Foam-RNNR-Onyx-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-03-07",
      "description": "The adidas Yeezy Foam RNR Onyx arrives with an Onyx, oval-cut foam construction made of part EVA and algae. At the base, a cushioned footbed offers comfort and support, while a sculptural sole with deep treads provides traction.\n<br>\n<br>\nThe adidas Yeezy Foam RNR Onyx released in June of 2022 and retailed for $80 and in March of 2024 and retailed for $90.",
      "urlKey": "adidas-yeezy-foam-rnnr-onyx",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-foam-rnnr-onyx"
      },
      "lowestResellPrice": {
        "stockX": 89
      }
    },
    {
      "shoeName": "adidas Yeezy Slide Slate Grey",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Slide",
      "styleID": "ID2350",
      "make": "adidas Yeezy Slide",
      "colorway": "Slate Grey/Slate Grey/Slate Grey",
      "retailPrice": 70,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Slide-Slate-Grey-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-03-21",
      "description": "The adidas Yeezy Slide Slate Grey is a collaboration between adidas and Kanye West.<br>​<br>​The Slide Slate Grey adidas Yeezy comes in a slate grey color palette. The shoe features an upper constructed from a single piece of molded EVA foam, offering a lightweight and durable design. The slide's design features strategic cutouts and a breathable lining. The slide's outsole features a textured pattern that provides traction and stability. The Yeezy Slide features an effortless slip-on design for easy wear and removal.<br>​<br>​What we love about the adidas Yeezy Slide Slate Grey is its minimalist and sleek design. The slide is crafted with a one-piece construction, featuring a soft and comfortable foam compound for the upper, while the Slate Grey colorway adds a versatile and understated aesthetic. The adidas Yeezy Slide Slate Grey was released in 2023, and sold for a retail price of $70.",
      "urlKey": "adidas-yeezy-slide-slate-grey",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-slide-slate-grey"
      },
      "lowestResellPrice": {
        "stockX": 108
      }
    },
    {
      "shoeName": "adidas Yeezy Boost 350 V2 MX Dark Salt",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Boost 350 V2",
      "styleID": "ID4811",
      "make": "adidas Yeezy Boost 350 V2",
      "colorway": "Dark Salt/Dark Salt/Dark Salt",
      "retailPrice": 230,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Boost-350-V2-MX-Dark-Salt-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2023-08-21",
      "description": "Released on August 21, 2023, the adidas Yeezy Boost 350 V2 MX Dark Salt is more than just a sneaker; it's a statement in style and comfort.\n<br>\n<br>\nA contrasting mix of grey and black shades adorn the upper. This blend not only exudes a unique aesthetic but signifies the contemporary flair of the Yeezy lineage. Paired with the signature outsole and side stripe this sneaker is an easy to style classic. The cushioned Boost midsole cradles your foot, and creates a comfortable wear for every day use.\n<br>\n<br>\nThe adidas Yeezy Boost 350 V2 MX Dark Salt came with a price tag of $230. A must-have for every sneaker aficionado. Get your pair on StockX now.",
      "urlKey": "adidas-yeezy-boost-350-v2-mx-dark-salt",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-boost-350-v2-mx-dark-salt"
      },
      "lowestResellPrice": {
        "stockX": 100
      }
    },
    {
      "shoeName": "adidas Yeezy Boost 350 V2 Onyx",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Boost 350 V2",
      "styleID": "HQ4540",
      "make": "adidas Yeezy Boost 350 V2",
      "colorway": "Onyx/Onyx/Onyx",
      "retailPrice": 230,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Boost-350-V2-Onyx-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2022-03-05",
      "description": "With a triple black Primeknit upper, the adidas Yeezy 350 V2 Onyx takes it back to the basics, using its muted palette to emphasize the intricacies of its construction. A sheer mesh side stripe and canvas heel loop offer a subtle contrast in texture. At the base, a matching signature Boost sole provides comfort and support.\n<br>\n<br>\nThe adidas Yeezy 350 V2 Onyx released in the Spring of 2022 and retailed for $220.",
      "urlKey": "adidas-yeezy-boost-350-v2-onyx",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-boost-350-v2-onyx"
      },
      "lowestResellPrice": {
        "stockX": 130
      }
    },
    {
      "shoeName": "adidas Yeezy Slide Dark Onyx",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Slide",
      "styleID": "ID5103",
      "make": "adidas Yeezy Slide",
      "colorway": "Dark Onyx/Dark Onyx/Dark Onyx",
      "retailPrice": 70,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Slide-Dark-Onyx-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-03-07",
      "description": "Step into unparalleled comfort and minimalist style with the adidas Yeezy Slide Dark Onyx. This sleek, monochromatic slide is the epitome of understated luxury, featuring a uniform dark onyx colorway that pairs effortlessly with any casual outfit. The Yeezy Slide's design focuses on simplicity and functionality, offering a sophisticated take on casual footwear.<br><br>Crafted for those who value both style and comfort, the adidas Yeezy Slide Dark Onyx is built with a plush material that molds to the shape of your foot, ensuring all-day comfort. Its minimalist aesthetic is complemented by the slide's practicality, making it the perfect choice for a relaxed day out or a cozy evening at home. The adidas Yeezy Slide has quickly become a staple in the wardrobe of the fashion-forward, thanks to its versatile design and unparalleled comfort.<br><br>Since its release on March 7, 2024, with a retail price of $70, the adidas Yeezy Slide Dark Onyx has established itself as a must-have for sneaker enthusiasts and style mavens alike. Its release has been met with enthusiasm, solidifying its status as a timeless piece of casual footwear. If you're seeking a blend of simplicity, comfort, and style, the adidas Yeezy Slide Dark Onyx is a choice that delivers on all fronts.",
      "urlKey": "adidas-yeezy-slide-dark-onyx",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-slide-dark-onyx"
      },
      "lowestResellPrice": {
        "stockX": 130
      }
    },
    {
      "shoeName": "adidas Yeezy Boost 350 V2 Steel Grey",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Boost 350 V2",
      "styleID": "IF3219",
      "make": "adidas Yeezy Boost 350 V2",
      "colorway": "Steel Grey/Steel Grey/Steel Grey",
      "retailPrice": 230,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Boost-350-V2-Steel-Grey-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-02-29",
      "description": "The adidas Yeezy Boost 350 V2 Steel Gray paints this classic Yeezy silhouette in a gray-on-gray colorway with a tonal rubber outsole.\n<br>\n<br>\nThis sneaker was released after Ye, formally known as Kanye West, and adidas ended their partnership. The upper is made of breathable PrimeKnit, which creates a bootie-like fit and conforms to the foot’s shape. A semi-translucent strip of knit material runs across the side panel and allows the foot to breathe. The knit in this area is slightly looser than on other parts of the upper. A ribbed TPU cage wraps around the full-length Boost midsole. Although the TPU cage comes in Steel Gray, its texture adds contrast to the shoe’s design.\n<br>\n<br>\nOur experts at StockX like the heel pull tab, which helps the wearer put on and take off the shoe. The adidas Yeezy Boost 350 V2 Steel Gray was released on February 29th, 2024, and retailed at $230.",
      "urlKey": "adidas-yeezy-boost-350-v2-steel-grey",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-boost-350-v2-steel-grey"
      },
      "lowestResellPrice": {
        "stockX": 107
      }
    },
    {
      "shoeName": "adidas Yeezy Slide Granite",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Slide",
      "styleID": "ID4132",
      "make": "adidas Yeezy Slide",
      "colorway": "Granite/Granite/Granite",
      "retailPrice": 70,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Slide-Granite-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2023-08-25",
      "description": "The adidas Yeezy Slide redefines cozy footwear, this time in the fresh Granite colorway. Released on August 25, 2023, the Yeezy slide continues to prove that less truly is more. Drawing inspiration from modern design the Yeezy Slide's aesthetic is top-tier.<br>​​<br>​Molded with a smooth, soft-to-touch finish, the sculpted look elevates every casual outfit. Ditching the conventional, this slide is made from slick, EVA and rubber, creating a one-piece design that graces the entire silhouette. The neutral granite hue is minimalistic perfection, blending effortlessly with every style and season.​<br>​​<br>​Highlighting the contoured footbed for that ultra-comfort feeling, it's all about slipping into luxury and making a statement. Whether it's beach days or city strolls, elevate the vibe with these slides. The adidas Yeezy Slide in Granite made its mark on August 25, 2023, with an attainable retail price of $70.",
      "urlKey": "adidas-yeezy-slide-granite",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-slide-granite"
      },
      "lowestResellPrice": {
        "stockX": 88
      }
    },
    {
      "shoeName": "adidas Yeezy Boost 350 V2 Bone",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Boost 350 V2",
      "styleID": "HQ6316",
      "make": "adidas Yeezy Boost 350 V2",
      "colorway": "Bone/Bone/Bone",
      "retailPrice": 230,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Boost-350-V2-Pure-Oat-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2022-03-21",
      "description": "The adidas Yeezy Boost 350 V2 Bone features a triple white Primeknit upper with mesh side stripes and canvas heel tabs. At the base, a semi-translucent sole with Boost technology completes the design.\n<br>\n<br>\nThe adidas Yeezy Boost 350 V2 Bone released in March of 2022 and retailed for $230.",
      "urlKey": "adidas-yeezy-boost-350-v2-bone",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-boost-350-v2-bone"
      },
      "lowestResellPrice": {
        "stockX": 130
      }
    },
    {
      "shoeName": "adidas Yeezy Boost 350 V2 Carbon Beluga",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Boost 350 V2",
      "styleID": "HQ7045",
      "make": "adidas Yeezy Boost 350 V2",
      "colorway": "Carbon Beluga/Steeple Grey/Solar Red",
      "retailPrice": 230,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-350-V2-Carbon-Beluga-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-05-27",
      "description": "Just in time for summer adidas and Kanye West delivered the Yeezy Boost 350 V2 Carbon Beluga, a revamped version of the classic Beluga colorway. The iconic partnership continues to defy expectations and redefine sneaker culture.\n<br>\n<br>\nWith the Carbon Beluga colorway, this drop showcased a fresh take on the beloved Beluga. The Primeknit upper wrapped around the Boost midsole is swathed in this cutting-edge colorway, infusing a familiar design with bold, modern energy. It screams street-ready while maintaining that sleek Yeezy aesthetic we all know and love. This is a sneaker that not only speaks to your style but also pushes it to new levels.\n<br>\n<br>\nThe adidas Yeezy Boost 350 V2 Carbon Beluga stomped onto the scene on May 31, 2023, with a retail price of $230. ",
      "urlKey": "adidas-yeezy-350-v2-carbon-beluga",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-350-v2-carbon-beluga"
      },
      "lowestResellPrice": {
        "stockX": 94
      }
    },
    {
      "shoeName": "adidas Yeezy 500 Stone Salt",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy 500",
      "styleID": "IE4783",
      "make": "adidas Yeezy 500",
      "colorway": "Stone Salt/Stone Salt/Stone Salt",
      "retailPrice": 210,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-500-Stone-Salt-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-03-11",
      "description": "The adidas Yeezy 500 Stone Salt hails from the branch of adidas that used to work in collaboration with Kanye West. This singular-looking sneaker sports the Yeezy vibe, with comfort and innovation working hand in glove.\n<br>\n<br>\nThe Stone Salt adidas Yeezy 500 features an upper base of lightweight, breathable gray mesh that is padded at the collar for enhanced comfort. Overlays of premium leather and cow suede undulate across the upper in shades ranging from beige to gray. A mudguard crafted from abrasion-resistant beige-gray rubber adds both durability and aesthetic uniqueness to this upper. The adiPrene+ midsole is structured in light gray pods for ultimate cushioning and shock absorption. Completing the form and function of this shoe is a gray rubber abstract outsole that enhances comfort while offering traction. \n<br>\n<br>\nThe aspect of this shoe that we enjoy the most is the addition of Ortholite insoles. That extra touch of underfoot attention emphasizes how indulgently comfortable these sneakers are. The adidas Yeezy 500 Stone Salt was released on March 11, 2024, for $210 retail.",
      "urlKey": "adidas-yeezy-500-stone-salt",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-500-stone-salt"
      },
      "lowestResellPrice": {
        "stockX": 89
      }
    },
    {
      "shoeName": "adidas Yeezy Slide Salt",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Slide",
      "styleID": "ID5480",
      "make": "adidas Yeezy Slide",
      "colorway": "Salt/Salt/Salt",
      "retailPrice": 70,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Slide-Salt-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-03-15",
      "description": "Enter the realm of sleek minimalism with the adidas Yeezy Slide Salt, a silhouette that redefines casual footwear. Embracing a monochromatic salt hue, this slide is a testament to the idea that true sophistication lies in simplicity. Designed with a smooth, seamless construction, the Yeezy Slide Salt offers an uncluttered, organic aesthetic that's as tranquil as its namesake.<br><br>The Yeezy Slide in Salt is crafted from a unique foam compound that blends lightweight comfort with durability, these slides are tailored for the trendsetters who seek to merge their laid-back lifestyles with high-fashion sensibilities. The soft, cushioned footbed conforms to your foot, making every step feel like a cloud—a testament to adidas and Yeezy's pursuit of innovation in comfort and design.<br><br>Having graced the market on March 15, 2024, and with a price tag of $70, the adidas Yeezy Slide Salt swiftly became the go-to choice for those who covet a fusion of luxe and leisure. Its release is celebrated as the moment when adidas and Yeezy once again elevated the everyday to the extraordinary. For the aficionados of minimalist chic, the adidas Yeezy Slide Salt has set a new benchmark in effortless style.",
      "urlKey": "adidas-yeezy-slide-salt",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-slide-salt"
      },
      "lowestResellPrice": {
        "stockX": 99
      }
    },
    {
      "shoeName": "adidas Yeezy Foam RNR MX Granite",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Foam RNR",
      "styleID": "IE4931",
      "make": "adidas Yeezy Foam RNR",
      "colorway": "Antoca/MX Granite/MX Granite",
      "retailPrice": 90,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Foam-RNR-MX-Granite-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2024-03-15",
      "description": "All of the different slides and slip-ons that Kanye West has created as part of his partnership with adidas feature outside-the-box designs. The adidas Yeezy Foam RNR MX Granite is one of the most creative options that Kanye came up with during the adidas x Yeezy collaboration.\n<br>\n<br>\nThis slip-on shoe features a single piece of EVA foam that has been carefully crafted to be both aesthetically pleasing and breathable for functionality. It includes a number of sculpted lines that give it an unorthodox appearance, while also delivering as much airflow as possible when the slip-on is worn. It's designed for maximum comfort, too, thanks to its textured footbed and contoured heel that help keep feet in place.\n<br>\n<br> \nBut according to our experts, the best part about this slip-on might just be its grey \"MX Granite\" colorway that has a camo-like feel to it. It adds one more cool touch to a modern take on the classic slip-on design. The adidas Yeezy Foam RNR MX Granite was released on March 15, 2024, for a retail price of $90.",
      "urlKey": "adidas-yeezy-foam-rnr-mx-granite",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-foam-rnr-mx-granite"
      },
      "lowestResellPrice": {
        "stockX": 75
      }
    },
    {
      "shoeName": "adidas Yeezy Slide Azure",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Slide",
      "styleID": "ID4133",
      "make": "adidas Yeezy Slide",
      "colorway": "Azure/Azure/Azure",
      "retailPrice": 70,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Slide-Azure-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2023-05-31",
      "description": "The Yeezy Slide in Azure hit the scene on May 31, 2023. Born from the innovative partnership of adidas and Yeezy, reshaping the way we see casual footwear. These slides have it all - style, comfort, and a nod to the bold.\n<br>\n<br>\nAdorned in a vibrant Azure hue, they are a celebration of color and a symbol of fearless style. The sleek EVA foam design offers more than just a unique aesthetic. It provides comfort that complements your daily hustle or chill out sessions equally. It's more than a slide. It's a statement. It's an ethos that embraces individuality and blurs the line between loungewear and streetwear.\n<br>\n<br>\nWith the adidas Yeezy Slide Azure, released at a retail price of $70, stepping into style has never been this effortless.",
      "urlKey": "adidas-yeezy-slide-azure",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-slide-azure"
      },
      "lowestResellPrice": {
        "stockX": 68
      }
    },
    {
      "shoeName": "adidas Yeezy Slide Bone (2022/2023 Restock)",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Slide",
      "styleID": "FZ5897",
      "make": "adidas Yeezy Slide",
      "colorway": "Bone/Bone/Bone",
      "retailPrice": 60,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Slide-Bone-2022-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2022-05-31",
      "description": "DISCLAIMER: US and UK sizing is the same and does not require any conversion.<br>\nThe adidas Yeezy Slide Bone (Restock Pair) features a slightly different composition than the original adidas Yeezy Slide Bone that debuted in the fall of 2019. Instead of a smooth EVA foam construction, it has a pebbled, more textural touch. At the base, a grooved sole and cushioned footbed completes the design.\n<br>\n<br>\nThe adidas Yeezy Slide Bone (Restock Pair) released in May of 2022 and retailed for $60.\n<br>\n<br>\nTo shop the original adidas Yeezy Slide Bone, <a href=\"https://stockx.com/yeezy-slide-bone\">click here.</a>",
      "urlKey": "adidas-yeezy-slide-bone-2022",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-slide-bone-2022"
      },
      "lowestResellPrice": {
        "stockX": 152
      }
    },
    {
      "shoeName": "adidas Yeezy 450 Utility Black",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy 450",
      "styleID": "H03665",
      "make": "adidas Yeezy 450",
      "colorway": "Utility Black/Utility Black-Utility Black",
      "retailPrice": 200,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-450-Utility-Black-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2022-08-02",
      "description": "The adidas Yeezy 450 Utility Black is made of synthetic fibers, a product of a combination of petroleum-based ethylene-vinyl acetate and foam from algae.\n<br>\n<br>\nThe design of adidas Yeez 450 Utility Black is renowned for its comfortable, tight, sock-like fit as well as its fashionable mesh style. The shoe has a semitranslucent rubber outsole and thermoplastic polyurethane (TPU) for performance and flexibility. The design of adidas Yeezy 450 comes in Utility Black.\n<br>\n<br>\nadidas Yeezy 450 Utility Black was released on February 8, 2022 at a retail price of $200.",
      "urlKey": "adidas-yeezy-450-utility-black",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-450-utility-black"
      },
      "lowestResellPrice": {
        "stockX": 91
      }
    },
    {
      "shoeName": "adidas Yeezy Boost 350 V2 Zebra",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Boost 350 V2",
      "styleID": "CP9654",
      "make": "adidas Yeezy Boost 350 V2",
      "colorway": "White/Core Black/Red",
      "retailPrice": 220,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Boost-350-V2-Zebra-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2017-02-25",
      "description": "Debuted in 2017, the adidas Yeezy Boost 350 V2 Zebra is known as one of the most renowned colorways in the Yeezy line. It features a white and black marbled Primeknit upper with a white side-stripe and red \"SPLY-350\" text. At the base, a cushioned Boost sole provides comfort and support.\n<br>\n<br>\nThe adidas Yeezy Boost 350 V2 Zebra released in February of 2017 and retailed for $220.",
      "urlKey": "adidas-yeezy-boost-350-v2-white-core-black-red",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-boost-350-v2-white-core-black-red"
      },
      "lowestResellPrice": {
        "stockX": 196
      }
    },
    {
      "shoeName": "adidas Yeezy Foam RNR MX Cinder",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Foam RNR",
      "styleID": "ID4126",
      "make": "adidas Yeezy Foam RNR",
      "colorway": "MX Cinder/MX Cinder/MX Cinder",
      "retailPrice": 90,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Foam-RNNR-MX-Brown-Blue-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1738193358",
      "releaseDate": "2023-05-31",
      "description": "The adidas Yeezy Foam RNNR MX Cinder is where high fashion meets innovative comfort. Wrapped in a MX Cinder colorway, this pair offers a unique combination of dark, earthy hues, giving it a versatile appeal that's equal parts streetwear-ready and avant-garde.<br><br>Constructed with a unique foam compound, the Yeezy Foam RNNR conforms to your foot for unparalleled comfort, while its distinctive, porous design gives off an out-of-this-world vibe. This sneaker pushes the boundaries of traditional footwear aesthetics and function, making it a must-have for trendsetters.With a fashion-forward design, the adidas Yeezy Foam RNNR MX Cinder not only elevates your style but promises ultimate comfort in every step. Take your sneaker game into the future.<br><br>The adidas Yeezy Foam RNNR MX Cinder released on May 31, 2023, with a retail price of $90.",
      "urlKey": "adidas-yeezy-foam-rnnr-mx-brown-blue",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-foam-rnnr-mx-brown-blue"
      },
      "lowestResellPrice": {
        "stockX": 73
      }
    },
    {
      "shoeName": "adidas Yeezy Boost 350 V2 Slate",
      "brand": "adidas",
      "silhoutte": "adidas Yeezy Boost 350 V2",
      "styleID": "HP7870",
      "make": "adidas Yeezy Boost 350 V2",
      "colorway": "Slate/Core Black/Slate",
      "retailPrice": 230,
      "thumbnail": "https://images.stockx.com/images/adidas-Yeezy-Boost-350-V2-Slate-Core-Black-Slate-Product.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&trim=color&q=90&dpr=2&updated_at=1743490772",
      "releaseDate": "2022-09-03",
      "description": "The adidas Yeezy Boost 350 V2 Slate Core Black Slate takes on a sock like design that is complemented with a neutral two-tone color scheme.\n<br>\n<br>\nThe Yeezy Boost 350 by adidas in black upper utilizes tan Primeknit construction, highlighted by distinctive center stitching down the vamp. A contrasting black streak adorns the lateral side with signature ‘SPLY-350’ branding. The shoe sits atop a Boost midsole, confined in a semi-translucent TPU cage for durability and support.\n<br>\n<br>\nThe adidas Yeezy Boost 350 V2 Slate Core Black Slate was originally released on the 3rd of September 2022, and initially retailed at $230.",
      "urlKey": "adidas-yeezy-boost-350-v2-slate-core-black-slate",
      "resellLinks": {
        "stockX": "https://stockx.com/adidas-yeezy-boost-350-v2-slate-core-black-slate"
      },
      "lowestResellPrice": {
        "stockX": 129
      }
    }
  ]